skillfair/app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("category", "image_url", "created_at", "updated_at") VALUES ('Cat', 'https://i.natgeofe.com/n/548467d8-c5f1-4551-9f58-6817a8d2c45e/NationalGeographic_2572187_16x9.jpg?w=1200', '2025-05-22 20:34:33.688997', '2025-05-22 20:34:33.688997') RETURNING "id"

    def set_item
      @item = Item.find(params.expect(:id))
---
SELECT "items".* FROM "items" WHERE "items"."id" = 5 LIMIT 1